// класс Кодер
class Coder(
        var skill: Int = 1, // скилл
        var fatigue: Float = 0.0f // усталость
) {

    // место для вашего кода

}

fun main() {
    // код здесь - для примера вам
    // val coder = Coder() // создаём кодера
    // println(coder.writeCode()) // кодер пишет код, отображаем этот код в консоли - будет 1 слово всего, потому что скилл изначально 1
    // coder.sleep(4) // даём кодеру поспать 4 часа
    // println(coder.fatigue) // выводим его усталость в консоль - будет 0, потому что поспал на -0.4
    // println(coder.writeCode()) // ещё разочек пишет код и в консоль - будет уже 2 слова
    // println(coder.skill) // отображаем его уровень - будет 3, потому что изначально 1 и 2 раза прокачались
}